app/Controllers/DetailEvent.php

    public function index($idevent)
    {
        $session = session();
        $userModel = new user();
        $MyEvent = new MyEventMod();
        $peserta = new Peserta();
        $jjura = new Juara();
        $namaPengguna = $session->get('id');
        $selectedevent = $MyEvent->where('id_event', $idevent)->findAll();
        $HH = $jjura->where('id_event', $idevent)->findAll();
        $semi1 = $HH[0]['id_user-semi1'];
        $semi2 = $HH[0]['id_user-semi2'];
        $semi3 = $HH[0]['id_user-semi3'];
        $semi4 = $HH[0]['id_user-semi4'];
        $final5 = $HH[0]['id_user-final1'];
        $final6 = $HH[0]['id_user-final2'];
        $j2 = $HH[0]['j2'];
        $j1 = $HH[0]['j1'];
        $j3 = $HH[0]['j3'];
        if (!$session->has('id')) {
            return redirect()->to(base_url('/home'));
        } else {
            $peserta1 = $peserta->where('id_event', $idevent)->findAll();
---
SELECT *
FROM `event`
WHERE `id_event` = '15'
SELECT *
FROM `event`
WHERE `id_event` = '11'

    public function peserta($idevent)
    {
        $session = session();
        $userModel = new user();
        $MyEvent = new MyEventMod();
        $peserta = new Peserta();
        $jjura = new Juara();
        $namaPengguna = $session->get('id');

        $selectedevent = $MyEvent->where('id_event', $idevent)->findAll();
        if (!$session->has('id')) {
            return redirect()->to(base_url('/home'));
        } else {
            $peserta1 = $peserta->where('id_event', $idevent)->findAll();
            $primaryKeys = array_column($peserta1, 'id_user');
            $countPeserta1 = count($peserta1);
            $showJoinButton = $countPeserta1 < 8;
            // Ambil data dari tabel_lain berdasarkan primary key yang terkait dengan peserta1
            $tabelLainData = [];
            if (!empty($primaryKeys)) {
                $tabelLainData = $userModel->whereIn('id_user', $primaryKeys)->findAll();
---
SELECT *
FROM `event`
WHERE `id_event` = '12'
SELECT *
FROM `peserta`
WHERE `id_event` = '12'
SELECT *
FROM `user`
WHERE `id_user` IN ('5')