app/Models/Juara.php

INSERT INTO `juara` (`id_event`) VALUES ('18')
---
    public function saveuser($wew)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($wew);