app/Models/MyEventMod.php

SELECT *
FROM `event`
WHERE `id_event` = 'hh'
 LIMIT 1
---
    public function getexpertslug($slug)
    {
        return $this->where('id_event', $slug)->first();