app/Models/Peserta.php

    public function saveuser($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
---
INSERT INTO `peserta` (`id_event`, `id_user`) VALUES ('18', '1')